
<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>3D Scene Reconstruction and Rendering from Multiple Images</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="This is our home page">
<meta property="og:type" content="website">
<meta property="og:title" content="3D Scene Reconstruction and Rendering from Multiple Images">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="3D Scene Reconstruction and Rendering from Multiple Images">
<meta property="og:description" content="This is our home page">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="3D Scene Reconstruction and Rendering from Multiple Images">
<meta name="twitter:description" content="This is our home page">
  
    <link rel="alternative" href="/atom.xml" title="3D Scene Reconstruction and Rendering from Multiple Images" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/css/style.css">
  <!--[if lt IE 9]><script src="//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7/html5shiv.min.js"></script><![endif]-->
  
</head>
<body>
<div id="container">
  <div id="wrap">
    <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">3D Scene Reconstruction and Rendering from Multiple Images</a>
      </h1>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="http://www.baidu.com/baidu" method="get" accept-charset="utf-8" class="search-form">
          <input type="search" name="word" maxlength="20" class="search-form-input" placeholder="Search">
          <input type="submit" value="" class="search-form-submit">
          <input name=tn type=hidden value="bds">
          <input name=cl type=hidden value="3">
          <input name=ct type=hidden value="2097152">
          <input type="hidden" name="si" value="yoursite.com">
        </form>
      </div>
    </div>
  </div>
</header>
    <div class="outer">
      <section id="main">
  
    <article id="post-week-4" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/06/16/week-4/" class="article-date">
  <time datetime="2016-06-16T15:15:42.000Z" itemprop="datePublished">2016-06-16</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Weekly-Report/">Weekly_Report</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/06/16/week-4/">Week 4</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="3D&#x6A21;&#x578B;&#x7684;&#x53EF;&#x89C6;&#x5316;"><a href="#3D&#x6A21;&#x578B;&#x7684;&#x53EF;&#x89C6;&#x5316;" class="headerlink" title="3D&#x6A21;&#x578B;&#x7684;&#x53EF;&#x89C6;&#x5316;"></a>3D&#x6A21;&#x578B;&#x7684;&#x53EF;&#x89C6;&#x5316;</h1><h2 id="Matlab&#x7684;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;"><a href="#Matlab&#x7684;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;" class="headerlink" title="Matlab&#x7684;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;"></a>Matlab&#x7684;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;</h2><p>&#x5728;&#x5F97;&#x5230;&#x4E86;&#x4E09;&#x7EF4;&#x91CD;&#x5EFA;&#x7684;ply&#x6A21;&#x578B;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x5728;PC&#x7AEF;&#x663E;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x5728;matlab&#x4E0B;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x663E;&#x793A;GUI&#x754C;&#x9762;&#xFF0C;&#x8BE5;&#x754C;&#x9762;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x663E;&#x793A;ply&#x6A21;&#x578B;&#x7684;&#x70B9;&#x4E91;&#x5750;&#x6807;&#x70B9;&#x4EE5;&#x53CA;&#x6240;&#x5E26;&#x7684;&#x989C;&#x8272;&#x7279;&#x5F81;&#x3002;&#x540C;&#x65F6;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x89C2;&#x5BDF;&#x8BBE;&#x8BA1;&#x4E86;&#x56DB;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x65CB;&#x8F6C;&#x6309;&#x94AE;&#x53EF;&#x4EE5;&#x66F4;&#x76F4;&#x89C2;&#x7684;&#x89C2;&#x5BDF;3&#x7EF4;&#x4FE1;&#x606F;&#xFF0C;&#x4E3B;&#x754C;&#x9762;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/06/16/week-4/1.jpg" alt="1.jpg"></p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6253;&#x5F00;&#x4E00;&#x4E2A;3&#x7EF4;&#x6A21;&#x578B;&#xFF0C;&#x540C;&#x65F6;&#x4E3A;&#x4E86;&#x4F7F;&#x5F97;&#x5728;matlab&#x4E0B;&#x663E;&#x793A;&#x901F;&#x5EA6;&#x52A0;&#x5FEB;&#xFF0C;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x91C7;&#x6837;&#x6B65;&#x957F;&#x53EF;&#x4EE5;&#x7A00;&#x758F;&#x663E;&#x793A;&#x6A21;&#x578B;&#x7684;&#x70B9;&#x96C6;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x6B65;&#x957F;&#x663E;&#x793A;&#x5728;&#x754C;&#x9762;&#x4E0A;&#x3002;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x663E;&#x793A;&#x3002;</p>
<p>&#x4EE5;&#x91CD;&#x5EFA;&#x751F;&#x6210;&#x7684;&#x72EE;&#x5B50;&#x5934;&#x6A21;&#x578B;&#xFF0C;&#x663E;&#x793A;&#x7684;&#x5B8C;&#x6210;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/06/16/week-4/2.jpg" alt="2.jpg"></p>
<p>&#x4E3A;&#x4E86;&#x5728;&#x4E0D;&#x540C;&#x89C6;&#x89D2;&#x4E0B;&#x89C2;&#x770B;&#xFF0C;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x81EA;&#x52A8;&#x7684;&#x52A8;&#x6001;&#x89C2;&#x770B;&#x6A21;&#x5F0F;&#xFF0C;&#x6B64;&#x65F6;&#x4E09;&#x7EF4;&#x6A21;&#x578B;&#x4F1A;&#x81EA;&#x52A8;&#x65CB;&#x8F6C;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x6536;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x89C2;&#x770B;&#x89D2;&#x5EA6;&#xFF0C;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/06/16/week-4/3.jpg" alt="3.jpg"></p>
<h2 id="&#x5B89;&#x5353;&#x7AEF;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;"><a href="#&#x5B89;&#x5353;&#x7AEF;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;" class="headerlink" title="&#x5B89;&#x5353;&#x7AEF;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;"></a>&#x5B89;&#x5353;&#x7AEF;&#x4E09;&#x7EF4;&#x663E;&#x793A;&#x7CFB;&#x7EDF;</h2><p>Android 3D Rendering<br>  &#x672C;&#x6B21;&#x5B9E;&#x9A8C;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x662F;&#x5BF9;&#x67D0;&#x4E00;&#x7269;&#x4F53;&#x591A;&#x5F20;&#x56FE;&#x7247;&#x8FDB;&#x884C;3D&#x91CD;&#x65B0;&#x5EFA;&#x6A21;&#x3002;&#x5EFA;&#x6A21;&#x90E8;&#x5206;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;ply&#x6587;&#x4EF6;&#x3002;&#x5B89;&#x5353;&#x7AEF;&#x9700;&#x8981;&#x5728;&#x901A;&#x8FC7;&#x5BF9;&#x8FD9;&#x4E2A;ply&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x624B;&#x673A;&#x7AEF;&#x5C4F;&#x5E55;&#x4E0A;&#x8FDB;&#x884C;&#x5C55;&#x793A;&#x3002;</p>
<p>  Android&#x7CFB;&#x7EDF;&#x4F7F;&#x7528; OpenGL &#x7684;&#x6807;&#x51C6;&#x63A5;&#x53E3;&#x6765;&#x652F;&#x6301;3D&#x56FE;&#x5F62;&#x529F;&#x80FD;&#xFF0C;android 3D &#x56FE;&#x5F62;&#x7CFB;&#x7EDF;&#x4E5F;&#x5206;&#x4E3A; java &#x6846;&#x67B6;&#x548C;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x4E24;&#x90E8;&#x5206;&#x3002;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x7684; OpenGL &#x63A5;&#x53E3;&#x7684;&#x5E93;&#xFF0C;&#x5728; Java &#x6846;&#x67B6;&#x5C42;&#xFF0C;javax.microedition.khronos.opengles &#x662F; java &#x6807;&#x51C6;&#x7684; OpenGL &#x5305;&#xFF0C;android.opengl&#x5305;&#x63D0;&#x4F9B;&#x4E86; OpenGL &#x7CFB;&#x7EDF;&#x548C; Android GUI &#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x3002;</p>
<p>  &#x56E0;&#x6B64;&#xFF0C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5148;&#x5BF9;ply&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;&#x89E3;&#x6790;&#x8FC7;&#x7A0B;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x9996;&#x5148;&#x662F;&#x5BF9;&#x5934;&#x90E8;&#x7684;&#x89E3;&#x6790;&#xFF0C;&#x8BFB;&#x53D6;&#x5230;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x4E2D;&#x7684;&#x7A7A;&#x95F4;&#x5C5E;&#x6027;&#x4E2A;&#x6570;&#xFF0C;&#x989C;&#x8272;&#x5C5E;&#x6027;&#x4E2A;&#x6570;&#x4EE5;&#x53CA;&#x9762;&#x5C5E;&#x6027;&#x4E2A;&#x6570;&#x3002;&#x7136;&#x540E;&#x6839;&#x636E;&#x5404;&#x5C5E;&#x6027;&#x7684;&#x4E2A;&#x6570;&#x5F00;&#x8F9F;&#x76F8;&#x5E94;&#x6570;&#x91CF;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x662F;&#x8BFB;&#x53D6;ply&#x6587;&#x4EF6;&#x7684;&#x6570;&#x503C;&#x90E8;&#x5206;&#xFF0C;&#x628A;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x503C;&#x8BFB;&#x53D6;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x7EC4;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5B8C;&#x6210;&#x5BF9;ply&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x89E3;&#x6790;&#x3002;</p>
<p>  &#x7136;&#x540E;&#x662F;&#x6570;&#x636E;&#x5C55;&#x793A;&#x90E8;&#x5206;&#x3002;&#x5728; Android &#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; GLSurfaceView &#x6765;&#x663E;&#x793A; OpenGL &#x89C6;&#x56FE;&#xFF0C;&#x8BE5;&#x7C7B;&#x4F4D;&#x4E8E; android.opengl &#x5305;&#x91CC;&#x9762;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x6E32;&#x67D3;3D &#x7684;&#x63A5;&#x53E3; Renderer.&#x4E3B;&#x8981;&#x9700;&#x8981;&#x8981;&#x5B9E;&#x73B0;&#x4ED6;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;onCreated&#xFF0C;onDrawFrame&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x7528;&#x6765;&#x5728;&#x56FE;&#x50CF;&#x521D;&#x59CB;&#x5316;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x9879;&#x65CB;&#x8F6C;&#x7684;&#x3002;&#x901A;&#x8FC7;nio&#x7684;buffer&#x6765;&#x4FDD;&#x5B58;&#x7B2C;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528;GLES20&#x91CC;&#x9762;&#x7684;&#x539F;&#x751F;&#x65B9;&#x6CD5;&#x6765;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;&#x65CB;&#x8F6C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x8FC7;&#x8BB0;&#x5F55;&#x4E0B;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x901A;&#x8FC7;&#x65CB;&#x8F6C;&#x77E9;&#x9635;&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#xFF0C;&#x8FBE;&#x5230;&#x65CB;&#x8F6C;&#x5C55;&#x793A;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>  &#x540C;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x64CD;&#x4F5C;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;reset&#x6309;&#x94AE;&#xFF0C;&#x5F53;&#x8BE5;&#x6309;&#x94AE;&#x88AB;&#x70B9;&#x51FB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91CD;&#x65B0;&#x8C03;&#x7528;&#x56FE;&#x5F62;&#x7684;oncreated&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x56FE;&#x50CF;&#x7684;&#x91CD;&#x65B0;&#x5C55;&#x793A;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x65B9;&#x4F53;&#x7684;&#x6548;&#x679C;&#x5C55;&#x793A;&#x3002;</p>
<p><img src="/2016/06/16/week-4/4.png" alt="4.png"></p>
<p>&#x5F88;&#x9057;&#x61BE;&#x7531;&#x4E8E;&#x6700;&#x7EC8;CMVS&#x751F;&#x6210;&#x7684;.ply&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x9762;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5728;&#x5B89;&#x5353;&#x7AEF;&#x6210;&#x529F;&#x663E;&#x793A;&#x81EA;&#x5DF1;&#x91CD;&#x5EFA;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EA;&#x80FD;&#x5728;PC&#x7AEF;&#x663E;&#x793A;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      
        <a data-url="http://yoursite.com/2016/06/16/week-4/" data-id="cipp034bm0005204q31lemd8q" class="article-share-link" data-share="baidu">分享到</a>
      

      

      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/week-4/">week_4</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-week-3" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/06/14/week-3/" class="article-date">
  <time datetime="2016-06-14T12:55:10.000Z" itemprop="datePublished">2016-06-14</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Weekly-Report/">Weekly_Report</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/06/14/week-3/">Week 3</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="&#x57FA;&#x4E8E;Bundler&#x3001;CMVS&#x7684;3D&#x91CD;&#x5EFA;"><a href="#&#x57FA;&#x4E8E;Bundler&#x3001;CMVS&#x7684;3D&#x91CD;&#x5EFA;" class="headerlink" title="&#x57FA;&#x4E8E;Bundler&#x3001;CMVS&#x7684;3D&#x91CD;&#x5EFA;"></a>&#x57FA;&#x4E8E;Bundler&#x3001;CMVS&#x7684;3D&#x91CD;&#x5EFA;</h1><p>&#x672C;&#x5468;&#x6211;&#x4EEC;&#x8C03;&#x7814;&#x5404;&#x79CD;&#x91CD;&#x5EFA;&#x65B9;&#x6CD5;&#xFF0C;&#x5C1D;&#x8BD5;&#x5404;&#x79CD;&#x4E00;&#x76F4;&#x7B97;&#x6CD5;&#x3002;&#x5C1D;&#x8BD5;&#x8FDB;&#x884C;3D&#x91CD;&#x5EFA;&#x3002;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7528;Bundler+CMVS&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x88AB;&#x5B9E;&#x73B0;&#x4E3A;&#x4E24;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x4ED4;&#x7EC6;&#x7814;&#x7A76;&#x5B66;&#x4E60;&#x4E86;&#x4E24;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x8C03;&#x8BD5;&#x70AE;&#x7B52;&#x4EE3;&#x7801;&#xFF0C;&#x5C06;&#x4E24;&#x4E2A;&#x8F6F;&#x4EF6;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x884C;&#x8FD0;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x65B9;&#x4FBF;&#x5730;&#x8FDB;&#x884C;3D&#x573A;&#x666F;&#x91CD;&#x5EFA;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5BF9;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x505A;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#x3002;</p>
<h2 id="&#x6982;&#x89C8;"><a href="#&#x6982;&#x89C8;" class="headerlink" title="&#x6982;&#x89C8;"></a>&#x6982;&#x89C8;</h2><p>&#x4ECE;&#x591A;&#x5E45;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x573A;&#x666F;&#x91CD;&#x5EFA;&#xFF08;3D Scene Reconstruction and Rendering from Multiple Iamges&#xFF09;&#xFF0C;&#x5C31;&#x662F;&#x4ECE;&#x4E00;&#x7CFB;&#x5217;2D&#x56FE;&#x7247;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;3D&#x6A21;&#x578B;&#x3002;&#x5B83;&#x662F;&#x4ECE;3D&#x573A;&#x666F;&#x4E2D;&#x83B7;&#x53D6;2D&#x56FE;&#x50CF;&#x7684;&#x9006;&#x8FC7;&#x7A0B;&#x3002;&#x6DF1;&#x5EA6;&#x4FE1;&#x606F;&#x7684;&#x7F3A;&#x5931;&#x6784;&#x6210;&#x6B64;&#x65F6;&#x9762;&#x4E34;&#x7684;&#x6700;&#x5927;&#x95EE;&#x9898;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;2D&#x56FE;&#x50CF;&#x4E0A;&#x7684;&#x70B9;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x786E;&#x5B9A;&#x4ED6;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x4E00;&#x6761;&#x7A7A;&#x95F4;&#x4E0A;&#x7684;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF08;&#x89C6;&#x7EBF;&#xFF09;&#x4E0A;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x5B83;&#x5728;&#x8FD9;&#x6761;&#x76F4;&#x7EBF;&#x7684;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7528;&#x5230;&#x7684;&#x6280;&#x672F;&#x79F0;&#x4E3A;&#x4E09;&#x89D2;&#x6D4B;&#x91CF;&#x6CD5;&#xFF08;Triangulation&#xFF09;.&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x4F60;&#x6709;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x70B9;&#x7684;&#x7A7A;&#x95F4;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x7531;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x4E2D;&#x8BE5;&#x70B9;&#x6240;&#x5728;&#x7684;&#x6295;&#x5F71;&#x5C04;&#x7EBF;&#x7684;&#x4EA4;&#x70B9;&#x786E;&#x5B9A;&#x3002;&#x90A3;&#x4E48;&#x505A;Triangulation&#x7684;&#x5173;&#x952E;&#x786E;&#x5B9A;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x6216;&#x8005;&#x8BF4;&#x4E24;&#x4E2A;&#x89C6;&#x56FE;&#x7684;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x4E4B;&#x4E2D;&#x76F8;&#x4E92;&#x5BF9;&#x5E94;&#x7684;&#x70B9;&#x3002;</p>
<p><img src="/2016/06/14/week-3/1.png" alt="1.png"></p>
<h2 id="&#x6D41;&#x7A0B;"><a href="#&#x6D41;&#x7A0B;" class="headerlink" title="&#x6D41;&#x7A0B;"></a>&#x6D41;&#x7A0B;</h2><p>3D&#x91CD;&#x5EFA;&#x7684;&#x5927;&#x4F53;&#x8FC7;&#x7A0B;&#x4E3A;&#xFF1A;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x4E0E;&#x5339;&#x914D;&#x3001;&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x7684;&#x4F30;&#x8BA1;&#x3001;&#x7A00;&#x758F;\&#x7A20;&#x5BC6;3D&#x91CD;&#x5EFA;&#x3002;&#x5927;&#x4F53;&#x8FC7;&#x7A0B;&#x5982;&#x56FE;&#xFF11;&#x3002;</p>
<h3 id="&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x4E0E;&#x5339;&#x914D;"><a href="#&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x4E0E;&#x5339;&#x914D;" class="headerlink" title="&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x4E0E;&#x5339;&#x914D;"></a>&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x4E0E;&#x5339;&#x914D;</h3><p>&#x56FE;&#xFF12;&#x663E;&#x793A;&#x7684;&#x662F;&#x7279;&#x5F81;&#x5339;&#x914D;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4ECE;&#x5404;&#x5F20;&#x56FE;&#x7247;&#x4E2D;&#x627E;&#x51FA;&#x7279;&#x5F81;&#x70B9;&#xFF08;&#x5229;&#x7528;SIFT&#x7B49;&#x7B97;&#x6CD5;&#xFF09;&#xFF0C;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x5230;&#x56FE;&#x7247;&#x4E4B;&#x95F4;&#x7684;&#x96C6;&#x5408;&#x7EA6;&#x675F;&#x5173;&#x7CFB;&#xFF0C;&#x6784;&#x5EFA;&#x51FA;&#x4E00;&#x4E2A;&#x51E0;&#x4F55;&#x56FE;&#x3002;</p>
<p><img src="/2016/06/14/week-3/0.png" alt="0.png"></p>
<h3 id="&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x7684;&#x4F30;&#x8BA1;"><a href="#&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x7684;&#x4F30;&#x8BA1;" class="headerlink" title="&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x7684;&#x4F30;&#x8BA1;"></a>&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x7684;&#x4F30;&#x8BA1;</h3><p>&#x56FE;&#xFF13;&#x8868;&#x793A;&#x7684;&#x662F;&#x8BA1;&#x7B97;&#x672C;&#x8D28;&#x77E9;&#x9635;&#xFF08;Essential Matrix&#xFF09;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5177;&#x4F53;&#x8FC7;&#x7A0B;&#x662F;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x65B9;&#x7A0B;&#x7EC4;&#x3002;</p>
<p><img src="/2016/06/14/week-3/5.png" alt="5.png"></p>
<p>&#x56FE;&#xFF14;&#x8868;&#x793A;&#x7684;&#x662F;&#x6839;&#x636E;&#x7531;&#x524D;&#x91CF;&#x5E45;&#x56FE;&#x50CF;&#x91CD;&#x5EFA;&#x7684;&#x4E09;&#x7EF4;&#x70B9;&#xFF08;x&#xFF09;&#x548C;&#x7B2C;&#x4E09;&#x5E45;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x70B9;&#x5229;&#x7528;&#x6821;&#x51C6;&#x6CD5;&#x8BA1;&#x7B97;&#x7B2C;&#x4E09;&#x4E2A;&#x76F8;&#x673A;&#x77E9;&#x9635;&#xFF08;Pi&#xFF09;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="/2016/06/14/week-3/2.png" alt="2.png"></p>
<h3 id="&#x7A00;&#x758F;&#x91CD;&#x5EFA;"><a href="#&#x7A00;&#x758F;&#x91CD;&#x5EFA;" class="headerlink" title="&#x7A00;&#x758F;&#x91CD;&#x5EFA;"></a>&#x7A00;&#x758F;&#x91CD;&#x5EFA;</h3><p>&#x7A00;&#x758F;&#x91CD;&#x5EFA;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x4E0A;&#x8FF0;&#x76F8;&#x673A;&#x7684;&#x59FF;&#x6001;&#x548C;&#x4F4D;&#x7F6E;&#x4F30;&#x8BA1;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x6C42;&#x89E3;&#x521D;&#x59CB;&#x56FE;&#x7247;&#x5BF9;&#x513F;&#x7684;&#x7EBF;&#x6027;&#x65B9;&#x7A0B;&#x7EC4;&#x6765;&#x4F30;&#x8BA1;&#x672C;&#x8D28;&#x77E9;&#x9635;&#xFF0C;&#x5BF9;&#x76F8;&#x673A;&#x77E9;&#x9635;&#x505A;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x7CBE;&#x786E;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x52A0;&#x5165;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x4F30;&#x8BA1;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x76F8;&#x673A;&#x77E9;&#x9635;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5149;&#x675F;&#x5E73;&#x5DEE;&#x6CD5;&#xFF08;Bundle Adjustment&#xFF09;&#x8FDB;&#x884C;&#x4E09;&#x7EF4;&#x70B9;&#x4F4D;&#x7F6E;&#x7684;&#x7CBE;&#x786E;&#x8BA1;&#x7B97;&#x3002;&#x91CD;&#x590D;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x77E5;&#x9053;&#x6CA1;&#x6709;&#x65B0;&#x7684;&#x76F8;&#x673A;&#x77E9;&#x9635;&#x5457;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x3002;&#x6D41;&#x7A0B;&#x56FE;&#x5982;&#x56FE;&#xFF15;&#x6240;&#x793A;<br>&#x3010;&#x5149;&#x675F;&#x5E73;&#x5DEE;&#x6CD5;&#xFF08;Bundle Adjustment&#xFF09;&#xFF1A;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x6295;&#x5F71;&#x91CD;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#x6709;&#x8BB8;&#x591A;&#x5BF9;&#x5E94;&#x70B9;&#x53EF;&#x7528;&#xFF0C;&#x9700;&#x8981;&#x91C7;&#x7528;&#x975E;&#x7EBF;&#x6027;&#x6700;&#x5C0F;&#x4E8C;&#x4E58;(Levenberg-Marquardt)&#x6C42;&#x89E3;&#xFF0C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x4E8C;&#x6B21;&#x6295;&#x5F71;&#x8BEF;&#x5DEE;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x975E;&#x7EBF;&#x6027;&#x6700;&#x5C0F;&#x4E8C;&#x4E58;&#x6CD5;&#x6765;&#x81EA;&#x4E8E;&#x6444;&#x5F71;&#x6D4B;&#x91CF;&#x4E2D;&#x7684;&#x5149;&#x675F;&#x5E73;&#x5DEE;&#x6CD5;&#x3002;&#x3011;</p>
<p><img src="/2016/06/14/week-3/3.png" alt="3.png"></p>
<p>&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x7684;&#x540C;&#x6837;&#x662F;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x3002;&#x8BE5;&#x6D41;&#x7A0B;&#x5EFA;&#x7ACB;&#x5728;&#x5C0F;&#x5B54;&#x6210;&#x50CF;&#x6A21;&#x578B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x9700;&#x8981;&#x4F30;&#x8BA1;&#x7684;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x6709;&#x7126;&#x8DDD;&#xFF08;focal length&#xFF09;,&#x5F84;&#x5411;&#x7578;&#x53D8;&#xFF08;k1, k2&#xFF09;&#xFF0C;&#x65CB;&#x8F6C;&#x77E9;&#x9635;(R)&#x548C;&#x5E73;&#x79FB;&#x77E9;&#x9635;&#xFF08;T&#xFF09;&#x3002;&#x4ECE;&#x4E09;&#x7EF4;&#x7A7A;&#x95F4;&#x70B9;&#x5230;&#x76F8;&#x673A;&#x70B9;&#x7684;&#x6620;&#x5C04;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#xFF1A;</p>
<pre><code>P = R * X + t       (conversion from world to camera coordinates)
p = -P / P.z        (perspective division)
p&apos; = f * r(p) * p   (conversion to pixel coordinates)
</code></pre><p>&#x5176;&#x4E2D;P.z&#x662F;P&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x8F74;&#xFF0C;r(p)&#x4E3A;</p>
<pre><code>r(p) = 1.0 + k1 * ||p||^2 + k2 * ||p||^4.
</code></pre><p>&#x56E0;&#x6B64;&#x6839;&#x636E;&#x4E0A;&#x5F0F;&#xFF0C;&#x5F97;&#x5230;&#x76F8;&#x673A;&#x7684;&#x671D;&#x5411;&#x4E3A;:</p>
<pre><code>R&apos; * [0 0 -1]&apos;  (i.e., the third row of R or third column of R&apos;)
</code></pre><p>&#x76F8;&#x673A;&#x7684;&#x4F4D;&#x7F6E;&#x4E3A;&#xFF1A;</p>
<pre><code>-R&apos; * t .
</code></pre><p><strong>&#x4E0A;&#x8FF0;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x901A;&#x5E38;&#x53EB;&#x505A;&#x8FD0;&#x52A8;&#x6062;&#x590D;&#x7ED3;&#x6784;&#xFF08;Structure from motion, SfM&#xFF09;&#x3002;</strong></p>
<h2 id="&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;"><a href="#&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;" class="headerlink" title="&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;"></a>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;</h2><p>&#x622A;&#x81F3;&#x76EE;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E86;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x901A;&#x901A;&#x5305;&#x88C5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6700;&#x7EC8;&#x5728;Ubuntu Linux 14.04&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x547D;&#x4EE4;&#x53EA;&#x6709;&#x4E00;&#x884C;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7A00;&#x758F;&#x91CD;&#x5EFA;&#x8FD8;&#x662F;&#x7A20;&#x5BC6;&#x91CD;&#x5EFA;&#x3002;</p>
<pre><code>&#x9884;&#x5904;&#x7406;
SIFT&#x7279;&#x5F81;&#x63D0;&#x53D6;
&#x5229;&#x7528;Bundler&#x8FDB;&#x884C;SfM&#x7A00;&#x758F;&#x91CD;&#x5EFA;
&#x5229;&#x7528;CMVS(Clustering Views for Multi-view Stereo)&#x8FDB;&#x884C;&#x7A20;&#x5BC6;&#x91CD;&#x5EFA;
</code></pre><p>&#xFF08;&#x4E0B;&#x622A;&#x56FE;&#x53D6;&#x81EA;&#x91CD;&#x5EFA;&#x4E24;&#x4E2A;&#x74F6;&#x5B50;&#x7684;&#x573A;&#x666F;&#x7684;&#x91CD;&#x5EFA;&#xFF09;</p>
<p>###&#x9884;&#x5904;&#x7406;<br>&#x7531;&#x4E8E;&#x540E;&#x8FB9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;David Lowe&#x7684;SIFT&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x5B83;&#x8981;&#x6C42;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x7684;&#x957F;&#x5BBD;&#x90FD;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;4000&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x8D85;&#x51FA;&#x7684;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x7F29;&#x653E;&#x3002;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8BBE;&#x7F6E;&#x3002;&#x3000;&#x7136;&#x540E;&#x8981;&#x63D0;&#x53D6;&#x56FE;&#x7247;&#x7684;EXIF&#x4FE1;&#x606F;&#xFF0C;&#x4FE1;&#x606F;&#x4E2D;&#x5305;&#x542B;&#x76F8;&#x673A;&#x7684;&#x751F;&#x4EA7;&#x5546;&#x3001;&#x76F8;&#x673A;&#x578B;&#x53F7;&#x548C;&#x5B9E;&#x9645;&#x7126;&#x8DDD;(mm&#x4E3A;&#x5355;&#x4F4D;)&#x7B49;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x53EA;&#x80FD;&#x624B;&#x673A;&#x8FDB;&#x884C;&#x62CD;&#x7167;&#xFF0C;&#x5FC5;&#x987B;&#x4E8B;&#x5148;&#x67E5;&#x8BE2;&#x76F8;&#x673A;&#x7684;&#x578B;&#x53F7;&#x5E76;&#x627E;&#x5230;&#x5176;ccd&#x4F20;&#x611F;&#x5668;&#x7684;&#x5BBD;&#x5EA6;&#x3002;&#x7136;&#x540E;&#x624D;&#x80FD;&#x8BA1;&#x7B97;&#x51FA;&#x4EE5;&#x50CF;&#x7D20;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x7126;&#x8DDD;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5177;&#x4F53;&#x5982;&#x4F55;&#x5C06;ccd&#x5BBD;&#x5EA6;&#x52A0;&#x5165;&#x5230;&#x7A0B;&#x5E8F;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x5199;&#x7684;readme.md&#x3002;</p>
<p><img src="/2016/06/14/week-3/6.png" alt="6.png"></p>
<p><img src="/2016/06/14/week-3/7.png" alt="7.png"></p>
<p>###&#x7279;&#x5F81;&#x63D0;&#x53D6;<br>&#x6211;&#x4EEC;&#x7684;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x91C7;&#x7528;&#x6700;&#x521D;&#x7684;SIFT&#x7B97;&#x6CD5;&#xFF0C;&#x7531;David Lowe&#x63D0;&#x51FA;&#x3002;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5176;&#x53EF;&#x6267;&#x884C;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x5373;&#x53EF;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5176;&#x4ED6;&#x6539;&#x8FDB;&#x540E;&#x7684;SIFT&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x5982;&#x679C;&#x540E;&#x9762;&#x8981;&#x4F7F;&#x7528;Bundler&#x8FDB;&#x884C;&#x7A00;&#x758F;&#x91CD;&#x5EFA;&#xFF0C;sift&#x63D0;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x6570;&#x636E;&#x5F62;&#x5F0F;&#x5FC5;&#x987B;&#x548C;David Lowe&#x7684;&#x5F62;&#x5F0F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;</p>
<p><img src="/2016/06/14/week-3/8.png" alt="8.png"></p>
<p>###&#x5229;&#x7528;Bundler&#x8FDB;&#x884C;SfM&#x7A00;&#x758F;&#x91CD;&#x5EFA;<br>Bundler&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x6574;&#x5957;&#x7684;SfM&#x6D41;&#x7A0B;&#xFF0C;&#x5305;&#x62EC;&#x76F8;&#x673A;&#x7684;&#x6807;&#x5B9A;&#x6821;&#x51C6;&#x548C;&#x70B9;&#x4E91;&#x7684;&#x8BA1;&#x7B97;&#x3002;&#x5177;&#x4F53;&#x539F;&#x7406;&#x5DF2;&#x7ECF;&#x5728;&#x4E0A;&#x8FB9;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FC7;&#x3002;&#xFF08;&#x52A0;building rome in a day&#x4E2D;&#x7684;&#x63CF;&#x8FF0;&#xFF09;&#x8FD9;&#x6837;&#x91CD;&#x5EFA;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x7A00;&#x758F;&#x7684;&#x70B9;&#x4E91;&#x3002;<br>feature matching and bundle adjustment</p>
<p><img src="/2016/06/14/week-3/9.png" alt="9.png"></p>
<p>###&#x5229;&#x7528;CMVS&#x8FDB;&#x884C;&#x7A20;&#x5BC6;&#x91CD;&#x5EFA;<br>CMVS(Clustering Views for Multi-view Stereo)[<a href="http://www.di.ens.fr/cmvs/" target="_blank" rel="external">http://www.di.ens.fr/cmvs/</a>] &#x53EF;&#x4EE5;&#x5C06;&#x5927;&#x91CF;&#x7684;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x5206;&#x89E3;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#xFF0C;&#x5E76;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;<strong>&#x5E76;&#x884C;&#x5730;</strong>&#x8FDB;&#x884C;&#x91CD;&#x5EFA;&#x3002;&#x8FD9;&#x6837;&#x5F97;&#x5230;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x91CD;&#x5EFA;&#x7ED3;&#x679C;&#x662F;&#x539F;&#x56FE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6700;&#x540E;&#x6574;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x6210;&#x5C40;&#x90E8;&#x5E76;&#x884C;&#x91CD;&#x5EFA;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x8F83;&#x591A;&#x65F6;&#x7684;&#x91CD;&#x5EFA;&#x901F;&#x5EA6;&#x3002;</p>
<p><img src="/2016/06/14/week-3/10.png" alt="10.png"></p>
<p><img src="/2016/06/14/week-3/11.png" alt="11.png"></p>
<p>&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;Meshlab&#x7B49;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x663E;&#x793A;&#x3002;<br>&#x8FD9;&#x91CC;&#x8FB9;&#x5C55;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x51E0;&#x7EC4;&#x7ED3;&#x679C;&#xFF0C;&#x5BC6;&#x7801;&#xFF1A;123456<br>&#x516C;&#x5F00;&#x6570;&#x636E;&#xFF1A;<br>&#x72EE;&#x5B50;&#x5934;&#x7A00;&#x758F;&#x91CD;&#x5EFA;</p>
<embed src="http://player.youku.com/player.php/sid/XMTYxNTUwNDAxMg==/v.swf" allowfullscreen="true" quality="high" width="480" height="400" align="middle" allowscriptaccess="always" type="application/x-shockwave-flash">

<p>&#x72EE;&#x5B50;&#x5934;&#x7A20;&#x5BC6;&#x91CD;&#x5EFA;</p>
<embed src="http://player.youku.com/player.php/sid/XMTYxNTUwNTgyNA==/v.swf" allowfullscreen="true" quality="high" width="480" height="400" align="middle" allowscriptaccess="always" type="application/x-shockwave-flash">

<p>&#x81EA;&#x884C;&#x62CD;&#x6444;&#x7684;&#x6570;&#x636E;&#xFF1A;<br>&#x74F6;&#x5B50;</p>
<embed src="http://player.youku.com/player.php/sid/XMTYxNTUwNjM4MA==/v.swf" allowfullscreen="true" quality="high" width="480" height="400" align="middle" allowscriptaccess="always" type="application/x-shockwave-flash">

<p>&#x5927;&#x95E8;</p>
<embed src="http://player.youku.com/player.php/sid/XMTYxNTUwNjU4MA==/v.swf" allowfullscreen="true" quality="high" width="480" height="400" align="middle" allowscriptaccess="always" type="application/x-shockwave-flash">

<h3 id="&#x6574;&#x5408;"><a href="#&#x6574;&#x5408;" class="headerlink" title="&#x6574;&#x5408;"></a>&#x6574;&#x5408;</h3><p>Bundler&#x548C;CMVS&#x90FD;&#x662F;&#x5F00;&#x6E90;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x7F16;&#x8BD1;&#x8FC7;&#x540E;&#xFF0C;&#x5C06;&#x5176;&#x4E8C;&#x8FDB;&#x5236;&#x53EF;&#x6267;&#x884C;&#x5BF9;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x8FDB;&#x884C;&#x4E86;&#x9884;&#x5904;&#x7406;&#x3001;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7B49;&#xFF0C;&#x5C06;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#x653E;&#x7F6E;&#x5230;&#x5408;&#x9002;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x4F9B;Bundler&#x548C;CMVS&#x8C03;&#x7528;&#xFF0C;&#x6700;&#x7EC8;&#x66B4;&#x9732;&#x7ED9;&#x7528;&#x6237;&#x7684;&#x53EA;&#x662F;&#x4E24;&#x4E2A;shell&#x811A;&#x672C;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x811A;&#x672C;&#x5E76;&#x8F93;&#x5165;&#x51E0;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x5B8C;&#x6210;&#xFF0C;&#x7B80;&#x5355;&#x6709;&#x6548;&#x3002;<br>&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x4E3A;&#xFF0C;</p>
<p><img src="/2016/06/14/week-3/12.png" alt="12.png"></p>
<p>&#x8FD0;&#x884C;&#x65B9;&#x6CD5;&#x4E3A;,<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">&#xFF03; sparse reconstruction</span><br><span class="line">./sparse_reconstruction.sh [path to your images] [scaling factor, default value is 1] </span><br><span class="line"># dense reconstruction</span><br><span class="line">./sparse_reconstruction.sh [path to your images] [scaling factor, default is 1]; ./dense_reconstruction.sh [path to sparse reconstruction folder] [number of photos in each CMVS clusters]</span><br></pre></td></tr></table></figure></p>
<p>&#x4F8B;&#x5B50;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">./sparse_reconstruction.sh ../data/bottles 0.5; ./dense_reconstruction.sh ./reconstruction 20</span><br></pre></td></tr></table></figure></p>
<p><img src="/2016/06/14/week-3/13.png" alt="13.png"></p>
<p>&#x9700;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x4F9D;&#x8D56;&#x4E00;&#x5B9A;&#x8981;&#x8BE6;&#x7EC6;&#x770B;&#x6211;&#x4EEC;&#x5199;&#x7684;readme.md</p>
<p>&#x5B9E;&#x9A8C;&#x7ED3;&#x679C;&#x8868;&#x660E;&#xFF0C;&#x91C7;&#x7528;David Lowe&#x7684;SIFT&#x63D0;&#x53D6;&#x7684;&#x7279;&#x5F81;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x9664;&#x4E86;&#x4E0A;&#x8FF0;&#x51E0;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x96D5;&#x5851;&#x56FE;&#x7247;&#x5F97;&#x4E0D;&#x5230;&#x826F;&#x597D;&#x7684;&#x91CD;&#x5EFA;&#x3002;&#x8BF4;&#x660E;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x7684;&#x7B97;&#x6CD5;&#x6BD4;&#x8F83;&#x5173;&#x952E;&#x3002;</p>
<p>&#x91CD;&#x5EFA;&#x8FC7;&#x7A0B;&#x5B8C;&#x6574;&#x89C6;&#x9891;&#xFF1A;</p>
<embed src="http://player.youku.com/player.php/sid/XMTYxNTU4Nzg0MA==/v.swf" allowfullscreen="true" quality="high" width="480" height="400" align="middle" allowscriptaccess="always" type="application/x-shockwave-flash">

      
    </div>
    <footer class="article-footer">
      
        <a data-url="http://yoursite.com/2016/06/14/week-3/" data-id="cipp034bh0004204q7bruqnty" class="article-share-link" data-share="baidu">分享到</a>
      

      

      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/week-3/">week_3</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-week-2" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/06/02/week-2/" class="article-date">
  <time datetime="2016-06-02T12:37:23.000Z" itemprop="datePublished">2016-06-02</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Weekly-Report/">Weekly_Report</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/06/02/week-2/">Week 2</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="&#x8BBA;&#x6587;&#x9605;&#x8BFB;&#xFF1A;Multi-camera-Scene-Reconstruction-via-Graph-Cuts"><a href="#&#x8BBA;&#x6587;&#x9605;&#x8BFB;&#xFF1A;Multi-camera-Scene-Reconstruction-via-Graph-Cuts" class="headerlink" title="&#x8BBA;&#x6587;&#x9605;&#x8BFB;&#xFF1A;Multi-camera Scene Reconstruction via Graph Cuts"></a>&#x8BBA;&#x6587;&#x9605;&#x8BFB;&#xFF1A;Multi-camera Scene Reconstruction via Graph Cuts</h1><p>Vladimir Kolmogorov and Ramin Zabih</p>
<h2 id="&#xFF08;&#xFF11;&#xFF09;&#x4ECB;&#x7ECD;"><a href="#&#xFF08;&#xFF11;&#xFF09;&#x4ECB;&#x7ECD;" class="headerlink" title="&#xFF08;&#xFF11;&#xFF09;&#x4ECB;&#x7ECD;"></a>&#xFF08;&#xFF11;&#xFF09;&#x4ECB;&#x7ECD;</h2><p>&#x6587;&#x7AE0;&#x7528;graph cut&#xFF08;&#x56FE;&#x5272;&#xFF09;&#x5373;&#x80FD;&#x91CF;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x591A;&#x76F8;&#x673A;&#x573A;&#x666F;&#x4E0B;&#x7684;&#x4E09;&#x7EF4;&#x91CD;&#x5EFA;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x80FD;&#x91CF;&#x6700;&#x5C0F;&#x5316;&#x65B9;&#x6CD5;&#x6709;&#x4E09;&#x4E2A;&#x7279;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x628A;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5BF9;&#x79F0;</li>
<li>&#x5B83;&#x5904;&#x7406;&#x7684;&#x80FD;&#x89C1;&#x5EA6;&#x5F97;&#x5F53;</li>
<li>&#x5B83;&#x4FDD;&#x6301;&#x7A7A;&#x95F4;&#x5E73;&#x6ED1;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x8FDE;&#x7EED;&#x6027;</li>
</ul>
<p>&#x6587;&#x7AE0;&#x6307;&#x51FA;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x65B9;&#x6CD5;&#xFF08;voxel occupancy,&#x4F53;&#x7D20;&#x5360;&#x6709;&#xFF09;&#x5B58;&#x5728;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E24;&#x5E45;&#x56FE;&#x7247;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4ECB;&#x7ECD;&#x4E86;&#x4E24;&#x79CD;&#x7B97;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x56FE;&#x7247;&#x4E00;&#x81F4;&#x6027;&#xFF0C;voxel color&#x548C;space carving&#x3002;</p>
<h2 id="&#xFF08;&#xFF12;&#xFF09;&#x95EE;&#x9898;&#x62BD;&#x8C61;"><a href="#&#xFF08;&#xFF12;&#xFF09;&#x95EE;&#x9898;&#x62BD;&#x8C61;" class="headerlink" title="&#xFF08;&#xFF12;&#xFF09;&#x95EE;&#x9898;&#x62BD;&#x8C61;"></a>&#xFF08;&#xFF12;&#xFF09;&#x95EE;&#x9898;&#x62BD;&#x8C61;</h2><p>&#x8BBE;&#x591A;&#x76F8;&#x673A;&#x62CD;&#x6444;n&#x5E45;&#x56FE;&#x50CF;&#xFF0C; $ P = P_1\bigcup &#x2026; \bigcup P_n $&#xFF0C;&#x4F53;&#x7D20;$p\in P$&#xFF1B;<br>&#x4EE4;&#x6807;&#x7B7E;&#x51FD;&#x6570;f&#x5C06;&#x4F53;&#x7D20;p&#x6620;&#x5C04;&#x5230;&#x4E0E;&#x6DF1;&#x5EA6;&#x76F8;&#x5173;&#x7684;&#x6807;&#x7B7E;$l$;<br>&#x8FD9;&#x6837;3D&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;\<p, l="">&#x5BF9;&#x6765;&#x8868;&#x793A;&#x3002;<br>&#x8FD9;&#x6837;&#x7684;&#x70B9;&#x53EA;&#x6709;&#x5F53;&#x4ED6;&#x4EEC;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;label&#xFF0C;&#x5373;$l$&#x76F8;&#x7B49;&#x65F6;&#x4ED6;&#x4EEC;&#x624D;&#x6709;&#x76F8;&#x4E92;&#x8054;&#x7CFB;&#xFF1B;</p,></p>
<p>&#x5B9A;&#x4E49;&#x9700;&#x8981;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x80FD;&#x91CF;&#x51FD;&#x6570;&#xFF1A;<br>$E(f) = E<em>{data}(f) + E</em>{smoothness}(f) + E_{visibility}(f)$</p>
<p><img src="/2016/06/02/week-2/1.png" alt="pic1"></p>
<p>&#x5176;&#x4E2D;$D(p, q)$&#x662F;&#x4F53;&#x7D20;$p$&#x548C;&#x4F53;&#x7D20;$q$&#x4E4B;&#x95F4;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>$$$$</p>
<p><img src="/2016/06/02/week-2/2.png" alt="pic2"><br><img src="/2016/06/02/week-2/3.png" alt="pic3"><br><img src="/2016/06/02/week-2/4.png" alt="pic4"></p>
<h2 id="&#xFF08;&#xFF13;&#xFF09;&#x56FE;&#x5272;"><a href="#&#xFF08;&#xFF13;&#xFF09;&#x56FE;&#x5272;" class="headerlink" title="&#xFF08;&#xFF13;&#xFF09;&#x56FE;&#x5272;"></a>&#xFF08;&#xFF13;&#xFF09;&#x56FE;&#x5272;</h2><p>&#x56FE;&#x5272;&#xFF08;Graph cuts&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x5341;&#x5206;&#x6709;&#x7528;&#x548C;&#x6D41;&#x884C;&#x7684;&#x80FD;&#x91CF;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x6B64;&#x65B9;&#x6CD5;&#x628A;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x95EE;&#x9898;&#x4E0E;&#x56FE;&#x989D;&#x6700;&#x5C0F;&#x5272;&#xFF08;min cut&#xFF09;&#x95EE;&#x9898;&#x76F8;&#x5173;&#x8054;&#x3002;&#x9996;&#x5148;&#x7528;&#x4E00;&#x4E2A;&#x65E0;&#x5411;&#x56FE;$G = <v, e="">$&#x8868;&#x793A;&#x8981;&#x5206;&#x5272;&#x7684;&#x56FE;&#x50CF;&#xFF0C;$V$&#x548C;$E$&#x5206;&#x522B;&#x662F;&#x9876;&#x70B9;&#xFF08;vertex&#xFF09;&#x548C;&#x8FB9;&#xFF08;edge&#xFF09;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6B64;&#x5904;&#x7684;Graph&#x548C;&#x666E;&#x901A;&#x7684;Graph&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x666E;&#x901A;&#x7684;&#x56FE;&#x7531;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x6784;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x8FB9;&#x662F;&#x6709;&#x65B9;&#x5411;&#x7684;&#x5219;&#x6210;&#x4E3A;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x5426;&#x5219;&#x4E3A;&#x65E0;&#x5411;&#x56FE;&#x3002;&#x800C;&#x4E14;&#x8FB9;&#x662F;&#x6709;&#x6743;&#x503C;&#x7684;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8FB9;&#x53EF;&#x4EE5;&#x53C8;&#x4E0D;&#x540C;&#x7684;&#x6743;&#x503C;&#xFF0C;&#x5206;&#x522B;&#x4EE3;&#x8868;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x7406;&#x610F;&#x4E49;&#x3002;&#x800C;Graph Cuts&#x6D89;&#x53CA;&#x7684;&#x56FE;&#x662F;&#x5728;&#x666E;&#x901A;&#x56FE;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x591A;&#x4E86;&#xFF12;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5B9A;&#x70B9;&#x5206;&#x522B;&#x7528;&#x7B26;&#x53F7;&#x201D;S&#x201C;&#x548C;&#x201D;T&#x201C;&#x8868;&#x793A;&#xFF0C;&#x7EDF;&#x79F0;&#x4E3A;&#x7EC8;&#x7AEF;&#x9876;&#x70B9;&#x3002;&#x5176;&#x5B83;&#x6240;&#x6709;&#x7684;&#x9876;&#x70B9;&#x90FD;&#x5FC5;&#x987B;&#x548C;&#x8FD9;&#xFF12;&#x4E2A;&#x9876;&#x70B9;&#x76F8;&#x8FDE;&#x5F62;&#x6210;&#x8FB9;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6240;&#x4EE5;Graph CUts&#x4E2D;&#x6709;&#x4E24;&#x79CD;&#x9876;&#x70B9;&#xFF0C;&#x4E5F;&#x6709;&#x4E24;&#x79CD;&#x8FB9;&#x3002;</v,></p>
<ul>
<li>&#x7B2C;&#x4E00;&#x79CD;&#x666E;&#x901A;&#x9876;&#x70B9;&#x5BF9;&#x5E94;&#x4E8E;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x3002;&#x6BCF;&#x4E24;&#x4E2A;&#x90BB;&#x57DF;&#x9876;&#x70B9;&#xFF08;&#x5BF9;&#x5E94;&#x4E8E;&#x56FE;&#x50CF;&#x4E2D;&#x6CA1;&#x4E24;&#x4E2A;&#x90BB;&#x57DF;&#x50CF;&#x7D20;&#xFF09;&#x7684;&#x8FDE;&#x63A5;&#x5C31;&#x662F;&#x4E00;&#x6761;&#x8FB9;&#x3002;&#x8FD9;&#x79CD;&#x8FB9;&#x4E5F;&#x53EB;n-links&#x3002;</li>
<li>&#x9664;&#x56FE;&#x50CF;&#x50CF;&#x7D20;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x7EC8;&#x7AEF;&#x9876;&#x70B9;&#xFF0C;&#x53EB;&#x6E90;&#x70B9;S(source)&#x548C;&#x6C47;&#x70B9;T(sink)&#x3002;&#x6BCF;&#x4E2A;&#x666E;&#x901A;&#x9876;&#x70B9;&#x548C;&#x8FD9;&#x4E24;&#x4E2A;&#x7EC8;&#x7AEF;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x90FD;&#x6709;&#x8FDE;&#x63A5;&#xFF0C;&#x7EC4;&#x6210;&#x7B2C;&#x4E8C;&#x79CD;&#x8FB9;&#xFF0C;&#x79F0;&#x4E3A;t-links&#x3002;</li>
</ul>
<p><img src="/2016/06/02/week-2/5.png" alt="pic5"></p>
<p>&#x56FE;&#x4E2D;&#x6BCF;&#x6761;&#x8FB9;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x975E;&#x8D1F;&#x7684;&#x6743;&#x503C;we&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;cost&#xFF08;&#x4EE3;&#x4EF7;&#x6216;&#x8005;&#x8D39;&#x7528;&#xFF09;&#x3002;&#x4E00;&#x4E2A;cut&#xFF08;&#x5272;&#xFF09;&#x5C31;&#x662F;&#x56FE;&#x4E2D;&#x8FB9;&#x96C6;&#x5408;E&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;C&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x5272;&#x7684;cost&#xFF08;&#x8868;&#x793A;&#x4E3A;|C|&#xFF09;&#x5C31;&#x662F;&#x8FB9;&#x5B50;&#x96C6;C&#x7684;&#x6240;&#x6709;&#x8FB9;&#x7684;&#x6743;&#x503C;&#x7684;&#x603B;&#x548C;&#x3002;</p>
<p>Graph Cuts&#x4E2D;&#x7684;Cuts&#x662F;&#x6307;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8FB9;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5F88;&#x663E;&#x7136;&#x8FD9;&#x4E9B;&#x8FB9;&#x96C6;&#x5408;&#x5305;&#x62EC;&#x4E86;&#x4E0A;&#x9762;2&#x79CD;&#x8FB9;&#xFF0C;&#x8BE5;&#x96C6;&#x5408;&#x4E2D;&#x6240;&#x6709;&#x8FB9;&#x7684;&#x65AD;&#x5F00;&#x4F1A;&#x5BFC;&#x81F4;&#x6B8B;&#x7559;&#x201D;S&#x201D;&#x548C;&#x201D;T&#x201D;&#x56FE;&#x7684;&#x5206;&#x5F00;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x79F0;&#x4E3A;&#x201C;&#x5272;&#x201D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5272;&#xFF0C;&#x5B83;&#x7684;&#x8FB9;&#x7684;&#x6240;&#x6709;&#x6743;&#x503C;&#x4E4B;&#x548C;&#x6700;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5C31;&#x79F0;&#x4E3A;&#x6700;&#x5C0F;&#x5272;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x56FE;&#x5272;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>Graph cut&#x7684;3x3&#x56FE;&#x50CF;&#x5206;&#x5272;&#x793A;&#x610F;&#x56FE;&#xFF1A;&#x6211;&#x4EEC;&#x53D6;&#x4E24;&#x4E2A;&#x79CD;&#x5B50;&#x70B9;&#xFF08;&#x5C31;&#x662F;&#x4EBA;&#x4E3A;&#x7684;&#x6307;&#x5B9A;&#x5206;&#x522B;&#x5C5E;&#x4E8E;&#x76EE;&#x6807;&#x548C;&#x80CC;&#x666F;&#x7684;&#x4E24;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x56FE;&#xFF0C;&#x56FE;&#x4E2D;&#x8FB9;&#x7684;&#x7C97;&#x7EC6;&#x8868;&#x793A;&#x5BF9;&#x5E94;&#x6743;&#x503C;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x5230;&#x6743;&#x503C;&#x548C;&#x6700;&#x5C0F;&#x7684;&#x8FB9;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF08;c&#xFF09;&#x4E2D;&#x7684;cut&#xFF0C;&#x5373;&#x5B8C;&#x6210;&#x4E86;&#x56FE;&#x50CF;&#x5206;&#x5272;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p><img src="/2016/06/02/week-2/6.png" alt="pic5"></p>

      
    </div>
    <footer class="article-footer">
      
        <a data-url="http://yoursite.com/2016/06/02/week-2/" data-id="cipp034bq0007204qmfuizbkk" class="article-share-link" data-share="baidu">分享到</a>
      

      

      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/week-2/">week_2</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-week-1" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/05/27/week-1/" class="article-date">
  <time datetime="2016-05-26T17:00:01.000Z" itemprop="datePublished">2016-05-27</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Weekly-Report/">Weekly_Report</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/05/27/week-1/">Week 1</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x672C;&#x5468;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x4E3B;&#x8981;&#x662F;&#xFF1A;&#xFF08;&#xFF11;&#xFF09;&#x8BE6;&#x7EC6;&#x9605;&#x8BFB;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x67E5;&#x8D44;&#x6599;&#x5E76;&#x4E86;&#x89E3;3D&#x573A;&#x666F;&#x91CD;&#x5EFA;&#x7684;&#x57FA;&#x672C;&#x6D41;&#x7A0B;&#xFF1B;&#xFF08;&#xFF12;&#xFF09;&#x642D;&#x5EFA;&#x5B89;&#x5353;&#x5F00;&#x53D1;&#x73AF;&#x5883;</p>
<h1 id="&#x8BBA;&#x6587;&#x9605;&#x8BFB;"><a href="#&#x8BBA;&#x6587;&#x9605;&#x8BFB;" class="headerlink" title="&#x8BBA;&#x6587;&#x9605;&#x8BFB;"></a>&#x8BBA;&#x6587;&#x9605;&#x8BFB;</h1><h2 id="3D-Reconstruction-and-Rendering-from-Image-Sequences"><a href="#3D-Reconstruction-and-Rendering-from-Image-Sequences" class="headerlink" title="3D Reconstruction and Rendering from Image Sequences"></a>3D Reconstruction and Rendering from Image Sequences</h2><p>R.Koch, J.-F. Evers-Senne, J.-M. Frahm, K.Koeser</p>
<h3 id="1-&#x4ECB;&#x7ECD;"><a href="#1-&#x4ECB;&#x7ECD;" class="headerlink" title="(1) &#x4ECB;&#x7ECD;"></a>(1) &#x4ECB;&#x7ECD;</h3><p>&#xA0;&#xA0;&#xA0;&#xA0;&#x6587;&#x7AE0;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;3D&#x573A;&#x666F;&#x7684;&#x8868;&#x9762;&#x91CD;&#x5EFA;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5408;&#x6210;&#x672A;&#x77E5;&#x9759;&#x6001;&#x573A;&#x666F;&#x7684;&#x65B0;&#x89C6;&#x89D2;&#x89C6;&#x56FE;&#x3002;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5927;&#x4F53;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x7EBF;&#x4E0B;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x548C;&#x7EBF;&#x4E0A;&#x4EA4;&#x4E92;&#x6E32;&#x67D3;&#x3002;<br>&#xA0;&#xA0;&#xA0;&#xA0;&#x5728;&#x7EBF;&#x4E0B;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x90E8;&#x5206;&#xFF0C;&#x5927;&#x4F53;&#x8FDB;&#x884C;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x4E3A;&#x901A;&#x8FC7;<strong>SfM(structure from motion)&#x65B9;&#x6CD5;</strong>&#x4F30;&#x8BA1;&#x76F8;&#x673A;&#x7684;&#x65B9;&#x4F4D;&#x4EE5;&#x53CA;&#x6807;&#x5B9A;&#x5176;&#x5185;&#x90E8;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7A00;&#x758F;&#x7684;3D&#x7279;&#x5F81;&#x70B9;&#x96C6;&#x3002;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x672C;&#x8EAB;&#x5C31;&#x5DF2;&#x7ECF;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x4E8E;&#x573A;&#x666F;&#x7684;&#x7A00;&#x758F;3D&#x63CF;&#x8FF0;&#x3002;&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x4F18;&#x5316;&#x6539;&#x5584;&#x4E0A;&#x4E00;&#x6B65;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x4ECE;&#x4E0A;&#x4E00;&#x6B65;&#x4E2D;&#x505A;&#x8FC7;&#x6807;&#x5B9A;&#x7684;&#x56FE;&#x7247;&#x4E2D;&#x4F30;&#x8BA1;&#x51FA;<strong>&#x7A20;&#x5BC6;&#x6DF1;&#x5EA6;&#x56FE;&#xFF08;dense depth maps&#xFF09;</strong>&#xFF0C;&#x8FDB;&#x800C;&#x8FDB;&#x884C;3D&#x573A;&#x666F;&#x51E0;&#x4F55;&#x7269;&#x4F53;&#x7684;refine&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E86;&#x7EBF;&#x4E0B;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x90E8;&#x5206;&#x4EE5;&#x540E;&#xFF0C;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x6807;&#x5B9A;&#x53C2;&#x6570;(the associated calibration)&#x3001;3D&#x62CD;&#x6444;&#x59FF;&#x6001;(3D pose)&#x548C;&#x7A20;&#x5BC6;&#x6DF1;&#x5EA6;&#x56FE;(dense depth map)&#x4F1A;&#x88AB;&#x8BA1;&#x7B97;&#x5E76;&#x5B58;&#x50A8;&#x3002;<br>&#xA0;&#xA0;&#xA0;&#xA0;&#x5728;&#x7EBF;&#x4E0A;&#x4EA4;&#x4E92;&#x6E32;&#x67D3;&#x90E8;&#x5206;&#xFF0C;&#x4F7F;&#x7528;VDGT(view-dependent geometry and texture models)&#x5229;&#x7528;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x7ED3;&#x679C;&#x6E32;&#x67D3;&#x5E76;&#x5448;&#x73B0;&#x51FA;&#x573A;&#x666F;&#x5728;&#x65B0;&#x89C6;&#x89D2;&#x7684;&#x89C6;&#x56FE;&#x3002;</p>
<h3 id="2-&#x7CFB;&#x7EDF;&#x6846;&#x56FE;"><a href="#2-&#x7CFB;&#x7EDF;&#x6846;&#x56FE;" class="headerlink" title="(2) &#x7CFB;&#x7EDF;&#x6846;&#x56FE;&#x3000;"></a>(2) &#x7CFB;&#x7EDF;&#x6846;&#x56FE;&#x3000;</h3><p><img src="/2016/05/27/week-1/3D_reconstruction_and_rendering_from_image_sequences.png" alt="System Diagram"></p>
<h3 id="3-&#x5206;&#x5757;&#x8BB2;&#x89E3;"><a href="#3-&#x5206;&#x5757;&#x8BB2;&#x89E3;" class="headerlink" title="(3) &#x5206;&#x5757;&#x8BB2;&#x89E3;"></a>(3) &#x5206;&#x5757;&#x8BB2;&#x89E3;</h3><ul>
<li>&#x7EBF;&#x4E0B;&#x6570;&#x636E;&#x91C7;&#x96C6;&#xFF08;offline data acquisition&#xFF09;<br>&#x5927;&#x4F53;&#x8FDB;&#x884C;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x4E3A;&#x901A;&#x8FC7;SfM(structure from motion)&#x65B9;&#x6CD5;&#x4F30;&#x8BA1;&#x76F8;&#x673A;&#x7684;&#x65B9;&#x4F4D;&#x4EE5;&#x53CA;&#x6807;&#x5B9A;&#x5176;&#x5185;&#x90E8;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7A00;&#x758F;&#x7684;3D&#x7279;&#x5F81;&#x70B9;&#x96C6;&#x3002;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x672C;&#x8EAB;&#x5C31;&#x5DF2;&#x7ECF;&#x7EC4;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x4E8E;&#x573A;&#x666F;&#x7684;&#x7A00;&#x758F;3D&#x63CF;&#x8FF0;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x5148;&#x7528;&#x4E00;&#x4E2A;2d feature detector&#x62BD;&#x53D6;&#x51FA;&#x56FE;&#x50CF;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;KLT-tracker&#x7B49;&#x627E;&#x5230;&#x573A;&#x666F;&#x7684;&#x4E0D;&#x540C;&#x89C6;&#x56FE;&#x4E4B;&#x95F4;&#x76F8;&#x5173;&#x7684;&#x7279;&#x5F81;&#x3002;&#x5339;&#x914D;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528;&#x5230;<strong>RANSAC&#x7B97;&#x6CD5;</strong>&#x3002;&#x7531;&#x4E8E;&#x6240;&#x6709;2D&#x89C6;&#x56FE;&#x90FD;&#x662F;&#x4E00;&#x4E2A;3D&#x573A;&#x666F;&#x5728;&#x4E0D;&#x540C;&#x89D2;&#x5EA6;&#x7684;&#x6295;&#x5F71;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x540C;&#x65F6;&#x4F30;&#x8BA1;&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;3D&#x7279;&#x5F81;&#x70B9;&#x6765;&#x8BA1;&#x7B97;&#x6240;&#x6709;&#x89C6;&#x7EBF;&#x7684;&#x4EA4;&#x53C9;&#x60C5;&#x51B5;&#x3002;&#x4E8E;&#x662F;<strong>bundle adjustment&#x7B97;&#x6CD5;</strong>&#x63D0;&#x70BC;&#x51FA;&#x63CF;&#x8FF0;&#x573A;&#x666F;&#x7ED3;&#x6784;&#x7684;3D&#x70B9;&#x5750;&#x6807;&#x3001;&#x76F8;&#x5BF9;&#x8FD0;&#x52A8;&#x53C2;&#x6570;&#x548C;&#x76F8;&#x673A;&#x7684;&#x5149;&#x5B66;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x76F8;&#x673A;&#x59FF;&#x6001;&#x548C;3D&#x7279;&#x5F81;&#x70B9;&#x3002;<br>&#x540C;&#x4E00;&#x573A;&#x666F;&#x7684;&#x4E0D;&#x540C;&#x89D2;&#x5EA6;&#x89C6;&#x56FE;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/05/27/week-1/angles.png" alt="Different Views of the Origianl Scene"><br>&#x573A;&#x666F;&#x539F;&#x56FE;&#x548C;3D&#x6807;&#x5B9A;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;<br><img src="/2016/05/27/week-1/calibration.png" alt="Overview image and calibration results"><br>&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x4F18;&#x5316;&#x6539;&#x5584;&#x4E0A;&#x4E00;&#x6B65;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x4ECE;&#x4E0A;&#x4E00;&#x6B65;&#x4E2D;&#x505A;&#x8FC7;&#x6807;&#x5B9A;&#x7684;&#x56FE;&#x7247;&#x4E2D;&#x4F30;&#x8BA1;&#x51FA;&#x7A20;&#x5BC6;&#x6DF1;&#x5EA6;&#x56FE;&#xFF08;dense depth maps&#xFF09;&#xFF0C;&#x8FDB;&#x800C;&#x8FDB;&#x884C;3D&#x573A;&#x666F;&#x51E0;&#x4F55;&#x7269;&#x4F53;&#x7684;refine&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x89C6;&#x56FE;&#x7684;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#x70B9;&#x8FDB;&#x884C;&#x6DF1;&#x5EA6;&#x4F30;&#x8BA1;&#x3002;&#x8BBA;&#x6587;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x65B9;&#x6CD5;&#x662F;multi-view stereoscopic depth estimation.</li>
<li>&#x7EBF;&#x4E0A;&#x4EA4;&#x4E92;&#x6E32;&#x67D3;&#xFF08;interactive online rendering&#xFF09;<br>&#x5728;&#x8FDB;&#x884C;&#x7EBF;&#x4E0A;&#x4EA4;&#x4E92;&#x6E32;&#x67D3;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x7684;&#x7167;&#x76F8;&#x673A;&#xFF0C;&#x4ECE;&#x65B0;&#x7684;&#x89D2;&#x5EA6;&#x67E5;&#x770B;&#x573A;&#x666F;&#x3002;&#x65B0;&#x89D2;&#x5EA6;&#x7684;&#x89C6;&#x56FE;&#x901A;&#x8FC7;&#x6839;&#x636E;&#x5DF2;&#x6709;&#x89C6;&#x56FE;&#x7684;&#x6807;&#x5B9A;&#x56FE;&#x548C;&#x6DF1;&#x5EA6;&#x56FE;&#x8FDB;&#x884C;&#x63D2;&#x503C;&#x800C;&#x5F97;&#x5230;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x6709;&#x51E0;&#x4E2A;&#xFF1A;&#x54EA;&#x4E9B;&#x56FE;&#x7247;&#x5BF9;&#x4E8E;&#x6240;&#x6C42;&#x89C6;&#x89D2;&#x6700;&#x4E3A;&#x5408;&#x9002;&#x3001;&#x600E;&#x6837;&#x8BA1;&#x7B97;&#x6DF1;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5C06;&#x539F;&#x56FE;&#x4E2D;&#x7684;&#x6587;&#x7406;&#x4FE1;&#x606F;&#x6DF7;&#x5408;&#x8FDB;&#x65B0;&#x7684;&#x89C6;&#x56FE;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x5B9E;&#x73B0;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5904;&#x7406;&#x7684;&#x5E27;&#x7387;&#x8981;&#x81F3;&#x5C11;&#x8FBE;&#x5230;10fps&#x3002;<br>&#x6587;&#x7AE0;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x7B56;&#x7565;&#x4E3A;&#xFF1A;<br>&#x2013; &#x9009;&#x62E9;&#x6700;&#x4F73;&#x7684;&#x76F8;&#x673A;&#x89C6;&#x56FE;<br>&#x2013; &#x878D;&#x5408;&#x4E0D;&#x540C;&#x89C6;&#x56FE;&#x7684;&#x51E0;&#x4F55;&#x7269;&#x4F53;<br>&#x2013; viewpoint-adaptive mesh generation<br>&#x2013; viewpoint-adaptive texture blending<br>&#x5177;&#x4F53;&#x6765;&#x8BB2;,&#x662F;&#x4F7F;&#x7528;&#x4E86;VDGT(Rendering with View dependent Geometry and Texture)&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x9009;&#x53D6;&#x4E0E;&#x65B0;&#x89C6;&#x89D2;&#x7684;&#x89C6;&#x70B9;&#x3001;&#x65B9;&#x5411;&#x3001;&#x516C;&#x5171;&#x89C6;&#x56FE;&#x5185;&#x5BB9;&#x6700;&#x76F8;&#x8FD1;&#x7684;&#x51E0;&#x4E2A;&#x76F8;&#x673A;&#x56FE;&#x7247;&#xFF0C;&#x5E76;&#x5C06;&#x4ED6;&#x4EEC;&#x7ECF;&#x8FC7;&#x56FE;&#x50CF;&#x626D;&#x66F2;&#xFF08;image warping&#xFF09;&#x62FC;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x8868;&#x9762;&#x4E0A;&#x3002;</li>
</ul>
<h1 id="&#x5B89;&#x5353;&#x73AF;&#x5883;&#x642D;&#x5EFA;"><a href="#&#x5B89;&#x5353;&#x73AF;&#x5883;&#x642D;&#x5EFA;" class="headerlink" title="&#x5B89;&#x5353;&#x73AF;&#x5883;&#x642D;&#x5EFA;"></a>&#x5B89;&#x5353;&#x73AF;&#x5883;&#x642D;&#x5EFA;</h1><h2 id="1-&#x8F6F;&#x4EF6;&#x7248;&#x672C;"><a href="#1-&#x8F6F;&#x4EF6;&#x7248;&#x672C;" class="headerlink" title="(1) &#x8F6F;&#x4EF6;&#x7248;&#x672C;"></a>(1) &#x8F6F;&#x4EF6;&#x7248;&#x672C;</h2><p>&#x91C7;&#x7528;0.86 beta &#x7248;&#x672C;&#x7684;Android Studio</p>
<h2 id="2-&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;"><a href="#2-&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;" class="headerlink" title="(2) &#x5B89;&#x88C5;&#x8FC7;&#x7A0B;"></a>(2) &#x5B89;&#x88C5;&#x8FC7;&#x7A0B;</h2><h3 id="1-&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5939;&#x914D;&#x7F6E;"><a href="#1-&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5939;&#x914D;&#x7F6E;" class="headerlink" title="1) &#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5939;&#x914D;&#x7F6E;"></a>1) &#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5939;&#x914D;&#x7F6E;</h3><blockquote>
<p>Android Studio&#x7684;&#x7F13;&#x5B58;&#x8DEF;&#x5F84;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x4E3B;&#x8981;&#x662F;&#x5B58;&#x653E;&#x4E00;&#x4E9B;Android Studio&#x8BBE;&#x7F6E;&#x548C;&#x63D2;&#x4EF6;&#x548C;&#x9879;&#x76EE;&#x7684;&#x7F13;&#x5B58;&#x4FE1;&#x606F;&#x7684;&#xFF0C;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5939;&#x5982;&#x56FE;&#xFF1A;</p>
<p><img src="/2016/05/27/week-1/1.png" alt="cache folder"></p>
<p>&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x5939;&#x662F;&#x9ED8;&#x8BA4;&#x5728;&#x78C1;&#x76D8;&#x4E2D;&#xFF0C;&#x968F;&#x7740;&#x9879;&#x76EE;&#x7684;&#x589E;&#x591A;&#xFF0C;&#x7F13;&#x5B58;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5927;,&#x751A;&#x81F3;&#x4F1A;&#x8FBE;&#x5230;&#x51E0;G&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x79FB;&#x5230;&#x975E;&#x7CFB;&#x7EDF;&#x76D8;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4E5F;&#x65B9;&#x4FBF;&#x4EE5;&#x540E;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x7684;&#x8FC1;&#x79FB;&#x3002;</p>
<p>&#x627E;&#x5230;Android Studio&#x6839;&#x76EE;&#x5F55;&#xFF0C;&#x8FDB;&#x5165;bin,&#x518D;&#x627E;&#x5230;idea.properties,&#x6253;&#x5F00;&#x5E76;&#x4FEE;&#x6539;&#x5B83;&#xFF0C;&#x627E;&#x5230;&#x8981;&#x4FEE;&#x6539;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x53BB;&#x6389;&#x6CE8;&#x91CA;&#x7B26;&#x53F7;&#x3002;&#x7136;&#x540E;&#x4FEE;&#x590D;&#x540E;&#x9762;&#x7684;&#x914D;&#x7F6E;&#x8DEF;&#x5F84;&#xFF0C;&#x5982;&#x56FE;</p>
<p><img src="/2016/05/27/week-1/2.png" alt="configuration screenshot"></p>
<p>&#x7136;&#x540E;&#x5C31;&#x80FD;&#x5728;&#x5B89;&#x88C5;&#x76EE;&#x5F55;&#x4E0B;&#x8FD0;&#x884C;&#x4E86;&#x3002;</p>
</blockquote>
<h3 id="2-&#x6784;&#x5EFA;&#x5DE5;&#x5177;-Gradle&#x7684;&#x914D;&#x7F6E;"><a href="#2-&#x6784;&#x5EFA;&#x5DE5;&#x5177;-Gradle&#x7684;&#x914D;&#x7F6E;" class="headerlink" title="2) &#x6784;&#x5EFA;&#x5DE5;&#x5177; Gradle&#x7684;&#x914D;&#x7F6E;"></a>2) &#x6784;&#x5EFA;&#x5DE5;&#x5177; Gradle&#x7684;&#x914D;&#x7F6E;</h3><blockquote>
<p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x662F;&#x6574;&#x4E2A;&#x914D;&#x7F6E;&#x8FC7;&#x7A0B;&#x7684;&#x5173;&#x952E;&#x3002;&#x9879;&#x76EE;&#x65E0;&#x6CD5;&#x7F16;&#x8BD1;&#x6216;&#x8005;&#x62A5;&#x9519;&#x7684;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x6E90;&#x4E8E;&#x6B64;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x597D;</p>
<p>Android Studio &#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x662F;&#x548C; eclipse &#x4E0D;&#x540C;&#x7684;. eclipse &#x8FC1;&#x79FB;&#x81F3; Android Studio &#x65F6;&#xFF0C;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x5BF9;&#x7167;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#xFF0C;&#x4EC5;&#x4F9B;&#x53C2;&#x8003;&#x548C;&#x660E;&#x786E;&#xFF0C;&#x65B9;&#x4FBF;&#x4EE5;&#x540E;&#x7684;&#x719F;&#x7EC3;&#x4F7F;&#x7528;.</p>
</blockquote>
<table>
<thead>
<tr>
<th>&#x5BF9;&#x6BD4;</th>
<th style="text-align:center">exlipse</th>
<th style="text-align:right">Android Studio</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x5DE5;&#x4F5C;&#x533A;</td>
<td style="text-align:center">workspace</td>
<td style="text-align:right">project</td>
</tr>
<tr>
<td>&#x9879;&#x76EE;</td>
<td style="text-align:center">project</td>
<td style="text-align:right">module</td>
</tr>
<tr>
<td>&#x5F15;&#x7528;</td>
<td style="text-align:center">preference</td>
<td style="text-align:right">module dependency</td>
</tr>
</tbody>
</table>
<blockquote>
<p>&#x7B80;&#x5355;&#x7684;&#x6765;&#x8BF4;&#xFF0C;android Stduio&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6BD4;&#x55BB;&#x6210;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x5916;&#x90E8;&#x7684;&#x4F9D;&#x8D56;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x7ED3;&#x6784;&#x5C31;&#x5F88;&#x6E05;&#x6670;&#x660E;&#x4E86;&#x3002;</p>
</blockquote>
<ul>
<li>&#x65B0;&#x5EFA;&#x9879;&#x76EE;</li>
</ul>
<blockquote>
<p>&#x57FA;&#x672C;&#x6B65;&#x9AA4;&#x7701;&#x7565;&#x81F3;&#x4E0B;&#x56FE; </p>
<p><img src="/2016/05/27/week-1/3.png" alt="new project"></p>
<p>&#x79BB;&#x7EBF;&#x914D;&#x7F6E;gradle&#x6587;&#x4EF6;&#xFF0C;&#x5148;&#x7528;&#x7CFB;&#x7EDF;&#x81EA;&#x5E26;&#x8FDB;&#x7A0B;&#x7BA1;&#x7406;&#x5668;&#x6740;&#x6B7B;android Studio,&#x7136;&#x540E;&#x6765;&#x5230;C&#x76D8;&#xFF0C;&#x627E;&#x5230;C:\Users\xxx.gradle\wrapper\dists ,xxx&#x4E3A;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x540D;&#xFF0C;&#x8FDB;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;,&#x5728;gradle&#x5B98;&#x7F51;&#x4E0B;&#x8F7D;&#xFF0C;1.12&#x7248;&#x672C;&#x7684;gradle,&#x9009;&#x62E9;1.12&#x7684;&#x7248;&#x672C;&#xFF0C;&#x9009;&#x62E9;gradle-1.12-all&#xFF0C;&#x4E0B;&#x8F7D;&#xFF0C;&#x5C06;&#x4E0B;&#x4E0B;&#x6765;&#x7684;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#x653E;&#x5728;&#x6B64;&#x76EE;&#x5F55;&#x5373;&#x53EF;&#x3002;</p>
<p><img src="/2016/05/27/week-1/4.png" alt="Alt text"></p>
</blockquote>

      
    </div>
    <footer class="article-footer">
      
        <a data-url="http://yoursite.com/2016/05/27/week-1/" data-id="cipp034b80000204q2j6st4fp" class="article-share-link" data-share="baidu">分享到</a>
      

      

      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/week-1/">week_1</a></li></ul>

    </footer>
  </div>
  
</article>


  
    <article id="post-Getting-Started" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2016/05/19/Getting-Started/" class="article-date">
  <time datetime="2016-05-19T11:47:45.000Z" itemprop="datePublished">2016-05-19</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/Weekly-Report/">Weekly_Report</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/05/19/Getting-Started/">Getting Started (Week 0)</a>
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h1 id="Porject-Introduction"><a href="#Porject-Introduction" class="headerlink" title="Porject Introduction"></a>Porject Introduction</h1><h2 id="topic"><a href="#topic" class="headerlink" title="topic"></a>topic</h2><p>3D Scene Reconstruction and Rendering from Multiple Images</p>
<h2 id="brief-description"><a href="#brief-description" class="headerlink" title="brief description"></a>brief description</h2><p>3D scene reconstruction is usually a task where multiple images of a scene is taken and a 3D surface of that scene is reconstructed. A system of 3D scene reconstruction should estimates camera pose and 3D scene geometry i.e. depth information. Building such a system mainly requires knowledge of computer graphics and image processing. We three are really looking forward to have a try on such a challenge. <strong>Over the next few weeks, we will update our progress in the project on this website. </strong></p>
<h2 id="course-requirements"><a href="#course-requirements" class="headerlink" title="course requirements"></a>course requirements</h2><p>3D reconstruction from multiple images is the creation of three-dimensional models from a set of images. It is the reverse process of obtaining 2D images from 3D scenes.<br>The essence of an image is a projection from a 3D scene onto a 2D plane, during which process the depth is lost. The 3D point corresponding to a specific image point is constrained to be on the line of sight. From a single image, it is impossible to determine which point on this line corresponds to the image point. If two images are available, then the position of a 3D point can be found as the intersection of the two projection rays. This process is referred to as triangulation. The key for thsi process is the relations between multiple views which convey the information that corresponding sets of points must contain some structure and that this structure is related to the poses and the calibration of the camera.</p>
<p>BONUS (Reslizing each of the following tasks you can gain up to 10% mor scores of your project score, i.e. your final project score = basic project score * 110%)</p>
<ol>
<li>Rendoring 3D scene on mobile devices(+10%)</li>
<li>Result evaluation on public datasets(+10%): Multi-View Stereo Dataset: <a href="http://vision.middlebury.edu/mview/" target="_blank" rel="external">http://vision.middlebury.edu/mview/</a></li>
</ol>
<h2 id="video-demo-from-the-web"><a href="#video-demo-from-the-web" class="headerlink" title="video demo (from the web):"></a>video demo (from the web):</h2><embed src="http://player.youku.com/player.php/sid/XOTQ4OTk2NDM2/v.swf" allowfullscreen="true" quality="high" width="480" height="400" align="middle" allowscriptaccess="always" type="application/x-shockwave-flash">

<h1 id="Group-Members"><a href="#Group-Members" class="headerlink" title="Group Members"></a>Group Members</h1><ul>
<li>&#x6768;&#x5B50;&#x67A2;&#xFF1A;2463454532@qq.com</li>
<li>&#x9F9A;&#x9038;&#x51CC;&#xFF1A;476174713@qq.com</li>
<li>&#x738B;&#x656C;&#x9756;&#xFF1A;413226895@qq.com</li>
<li>&#x9648;&#x4FCA;&#xFF1A;1924153192@qq.com</li>
</ul>
<h1 id="Current-Plan-for-Next-Week"><a href="#Current-Plan-for-Next-Week" class="headerlink" title="Current Plan for Next Week"></a>Current Plan for Next Week</h1><ol>
<li>Read papers and learn basics about 3D scene reconstruction; dicussions will be held.</li>
<li>Learn Android programming</li>
<li>Confirm duties and responsibilities, i.e. division of labor</li>
</ol>
<h1 id="References"><a href="#References" class="headerlink" title="References"></a>References</h1><p>[1] Multi-camera scene reconstruction via graph cuts, ECCV 2002<br>[2] 3D Reconstruction and Rendering from Image Sequences<br>[3] Scene Reconstruction and Visualization from Internet Photo Collections, 2008</p>

      
    </div>
    <footer class="article-footer">
      
        <a data-url="http://yoursite.com/2016/05/19/Getting-Started/" data-id="cipp034bd0001204qubykkqio" class="article-share-link" data-share="baidu">分享到</a>
      

      

      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/week-0/">week_0</a></li></ul>

    </footer>
  </div>
  
</article>


  
  
</section>
      
      <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">分类</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/Weekly-Report/">Weekly_Report</a><span class="category-list-count">5</span></li></ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/week-0/">week_0</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/week-1/">week_1</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/week-2/">week_2</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/week-3/">week_3</a><span class="tag-list-count">1</span></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/week-4/">week_4</a><span class="tag-list-count">1</span></li></ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">标签云</h3>
    <div class="widget tagcloud">
      <a href="/tags/week-0/" style="font-size: 10px;">week_0</a> <a href="/tags/week-1/" style="font-size: 10px;">week_1</a> <a href="/tags/week-2/" style="font-size: 10px;">week_2</a> <a href="/tags/week-3/" style="font-size: 10px;">week_3</a> <a href="/tags/week-4/" style="font-size: 10px;">week_4</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">归档</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/06/">六月 2016</a><span class="archive-list-count">3</span></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/05/">五月 2016</a><span class="archive-list-count">2</span></li></ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">近期文章</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2016/06/16/week-4/">Week 4</a>
          </li>
        
          <li>
            <a href="/2016/06/14/week-3/">Week 3</a>
          </li>
        
          <li>
            <a href="/2016/06/02/week-2/">Week 2</a>
          </li>
        
          <li>
            <a href="/2016/05/27/week-1/">Week 1</a>
          </li>
        
          <li>
            <a href="/2016/05/19/Getting-Started/">Getting Started (Week 0)</a>
          </li>
        
      </ul>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">友情链接</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="http://lbmedia.ece.ucsb.edu/member/uweb/Teaching/website/index.htm" target="_blank">课程链接</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
      
    </div>
    <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 杨子枢，龚逸凌，王敬靖<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
      .
      Theme by <a href="https://github.com/xiangming/landscape-plus" target="_blank">Landscape-plus</a>
    </div>
  </div>
</footer>
  </div>
  <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
  <!-- totop start -->
<div id="totop">
<a title="返回顶部"><img src="/img/scrollup.png"/></a>
</div>

<!-- totop end -->


<!-- 百度分享 start -->

<div id="article-share-box" class="article-share-box">
  <div id="bdshare" class="bdsharebuttonbox article-share-links">
    <a class="article-share-weibo" data-cmd="tsina" title="分享到新浪微博"></a>
    <a class="article-share-weixin" data-cmd="weixin" title="分享到微信"></a>
    <a class="article-share-qq" data-cmd="sqq" title="分享到QQ"></a>
    <a class="article-share-renren" data-cmd="renren" title="分享到人人网"></a>
    <a class="article-share-more" data-cmd="more" title="更多"></a>
  </div>
</div>
<script>window._bd_share_config={"common":{},"share":{"bdCustomStyle":"/css/bdshare.css"}};with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='http://bdimg.share.baidu.com/static/api/js/share.js?cdnversion='+~(-new Date()/36e5)];</script>

<!-- 百度分享 end -->

<script src="//cdnjs.cloudflare.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>




<! -- mathjax config similar to math.stackexchange -->

<script type="text/x-mathjax-config">
MathJax.Hub.Config({
tex2jax: {
          inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
                processEscapes: true
                    
}
  
        });
</script>

<script type="text/x-mathjax-config">
MathJax.Hub.Config({
tex2jax: {
            skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
                  
}
    
        });
</script>

<script type="text/x-mathjax-config">
MathJax.Hub.Queue(function() {
            var all = MathJax.Hub.getAllJax(), i;
            for(i=0; i < all.length; i += 1) {
                            all[i].SourceElement().parentNode.className += ' has-jax';
                                    
            }
                
        });
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>


<script src="/js/script.js"></script>

</div>
</body>
</html>
